# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [2]:
# your answer here
import pandas as pd

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [11]:
# your answer here
employee = pd.read_csv("data/Employee.csv")
employee.head()
employee.isna().sum()

Name          0
Department    0
Education     0
Gender        0
Title         0
Years         0
Salary        0
dtype: int64

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [6]:
# Method 1
# your answer here
mean_salary_by_department = employee.groupby('Department')['Salary'].mean()
print(mean_salary_by_department)

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [10]:
# Method 2
# your answer here
mean_salary_pivot = pd.pivot_table(employee, index='Department', columns='Title', values='Salary', aggfunc='mean')
mean_salary_pivot

Title         VP  analyst  associate
Department
HR          70.0     32.5        NaN
IT          70.0     32.5       60.0
Sales        NaN      NaN       55.0

In [ ]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [13]:
# your answer here
# Create pivot table with mean salary and years of work experience by department and title
mean_salary_pivot = pd.pivot_table(employee, index='Department', columns='Title', values=['Salary', 'Years'], aggfunc='mean')

mean_salary_pivot

           Salary                   Years
Title          VP analyst associate    VP analyst associate
Department
HR           70.0    32.5       NaN   8.0     3.0       NaN
IT           70.0    32.5      60.0   8.0     1.5       7.0
Sales         NaN     NaN      55.0   NaN     NaN       2.5

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [15]:
# your answer here
# Create pivot table with mean salary and count of employees by department and title
pivot_table = pd.pivot_table(employee, index=['Department', 'Title'], values=['Salary', 'Name'], aggfunc={'Salary': 'mean', 'Name': 'count'})

# Rename the 'Name' column to 'Number of Employees'
pivot_table.rename(columns={'Name': 'Number of Employees'}, inplace=True)

pivot_table

                      Number of Employees  Salary
Department Title
HR         VP                           1    70.0
           analyst                      2    32.5
IT         VP                           1    70.0
           analyst                      2    32.5
           associate                    1    60.0
Sales      associate                    2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [17]:
# your answer here
# Create pivot table with median, minimum, maximum, and standard deviation of salary by department and title
pivot_table = pd.pivot_table(employee, index=['Department', 'Title'], values='Salary', aggfunc=['median', 'min', 'max', 'std'])

pivot_table

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [18]:
# your answer here
# Fill missing values with the median salary for each department and job title
pivot_table.fillna(pivot_table.median(), inplace=True)

pivot_table

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  3.535534
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  3.535534
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  3.535534
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [19]:
# your answer here
# Grouping by department and aggregating the sum of salaries and count of employees
department_summary = employee.groupby('Department').agg({'Salary': 'sum', 'Name': 'count'})

# Renaming the columns for clarity
department_summary.rename(columns={'Salary': 'Total Salary', 'Name': 'Number of Employees'}, inplace=True)

department_summary

            Total Salary  Number of Employees
Department
HR                   135                    3
IT                   195                    4
Sales                110                    2

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [21]:
# your answer here
# Grouping by department and title and aggregating the total years and mean salary
department_title_summary = employee.groupby(['Department', 'Title']).agg({'Years': 'sum', 'Salary': 'mean'})

# Renaming the columns for clarity
department_title_summary.rename(columns={'Years': 'Total Years of Work Experience', 'Salary': 'Mean Salary'}, inplace=True)

department_title_summary

                      Total Years of Work Experience  Mean Salary
Department Title
HR         VP                                      8         70.0
           analyst                                 6         32.5
IT         VP                                      8         70.0
           analyst                                 3         32.5
           associate                               7         60.0
Sales      associate                               5         55.0

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [23]:
# your answer here
# Define a custom function to calculate mean after removing maximum value
def mean_without_max(x):
    max_value = x.max()
    return x[x < max_value].mean()

# Create pivot table with mean salary after removing maxima by department and title
pivot_table_without_max = pd.pivot_table(employee, index=['Department', 'Title'], values='Salary', aggfunc=mean_without_max)

pivot_table_without_max

                    Salary
Department Title
HR         analyst      30
IT         analyst      30